#ifndef _GREAT_H_
#define _GREAT_H_
//=============================================================================
//
// パーフェクトヘッダー [great.h]
// Author : Suzuki Mahiro
//
//=============================================================================

//=============================================================================
// インクルード
//=============================================================================
#include "scene.h"

//=============================================================================
// マクロ定義
//=============================================================================
#define MAX_NUMBER		(2)				// ナンバーの桁数
#define MAX_RANKING		(5)				// ランキングの数
#define GREAT_POS_X	(400.0f)		// ランキングの横の座標
#define GREAT_POS_Y	(650.0f)		// ランキングの縦の座標
#define RANKING_SIZE_X	(15.0f)			// ランキングの横のサイズ
#define RANKING_SIZE_Y	(20.0f)			// ランキングの縦のサイズ

#define MY_RANKING_SIZE_X	(55.0f)		// ランキングの横のサイズ
#define MY_RANKING_SIZE_Y	(60.0f)		// ランキングの縦のサイズ

//=============================================================================
// 前置宣言
//=============================================================================
class CNumber2d;

//=============================================================================
// レンダラークラス
//=============================================================================
class CGreat : public CScene
{
public:
	CGreat();				// コンストラクタ
	~CGreat();			// デストラクタ

							// メンバ関数
	HRESULT Init(void);	// 初期化処理
	void Uninit(void);											// 終了処理
	void Update(void);											// 更新処理
	void Draw(void);											// 描画処理
	static CGreat *Create(void);								// 生成

private:
	CNumber2d *m_pGreat[MAX_NUMBER];	// 桁数分
	int m_nGreat;									// スコア
};

#endif