#ifndef _GREAT_H_
#define _GREAT_H_
//=============================================================================
//
// グレートヘッダー [great.h]
// Author : Suzuki Mahiro
//
//=============================================================================

//=============================================================================
// インクルード
//=============================================================================
#include "scene.h"

//=============================================================================
// マクロ定義
//=============================================================================
#define MAX_NUMBER		(2)				// ナンバーの桁数
#define GREAT_POS_X		(332.0f)		// グレートの横の座標
#define GREAT_POS_Y		(525.0f)		// グレートの縦の座標
#define GREAT_SIZE_X	(35.0f)			// グレートの横のサイズ
#define GREAT_SIZE_Y	(40.0f)			// グレートの縦のサイズ

//=============================================================================
// 前置宣言
//=============================================================================
class CNumber2d;

//=============================================================================
// レンダラークラス
//=============================================================================
class CGreat : public CScene
{
public:
	CGreat();				// コンストラクタ
	~CGreat();			// デストラクタ

							// メンバ関数
	HRESULT Init(void);	// 初期化処理
	void Uninit(void);											// 終了処理
	void Update(void);											// 更新処理
	void Draw(void);											// 描画処理
	static CGreat *Create(void);								// 生成

private:
	CNumber2d *m_pGreat[MAX_NUMBER];	// 桁数分
	int m_nGreat;									// スコア
};

#endif