#ifndef _PERFECT_H_
#define _PERFECT_H_
//=============================================================================
//
// パーフェクトヘッダー [perfect.h]
// Author : Suzuki Mahiro
//
//=============================================================================

//=============================================================================
// インクルード
//=============================================================================
#include "scene.h"

//=============================================================================
// マクロ定義
//=============================================================================
#define MAX_NUMBER		(2)				// ナンバーの桁数
#define PERFECT_POS_X	(510.0f)		// パーフェクトの横の座標
#define PERFECT_POS_Y	(525.0f)		// パーフェクトの縦の座標
#define PERFECT_SIZE_X	(35.0f)			// パーフェクトの横のサイズ
#define PERFECT_SIZE_Y	(40.0f)			// パーフェクトの縦のサイズ

//=============================================================================
// 前置宣言
//=============================================================================
class CNumber2d;

//=============================================================================
// レンダラークラス
//=============================================================================
class CPerfect : public CScene
{
public:
	CPerfect();				// コンストラクタ
	~CPerfect();			// デストラクタ

							// メンバ関数
	HRESULT Init(void);	// 初期化処理
	void Uninit(void);											// 終了処理
	void Update(void);											// 更新処理
	void Draw(void);											// 描画処理
	static CPerfect *Create(void);								// 生成

private:
	CNumber2d *m_pPerfect[MAX_NUMBER];	// 桁数分
	int m_nPerfect;									// スコア
};

#endif