#ifndef _TIME_LIMIT_H_
#define _TIME_LIMIT_H_
//=============================================================================
//
// 制限時間 [time_limit.h]
// Author : Masuzawa Mirai
//
//=============================================================================

//=============================================================================
// インクルード
//=============================================================================
#include "main.h"
#include "evaluation_ui.h"

//=============================================================================
// マクロ定義
//=============================================================================
#define DEFAULT_TIME 200

//=============================================================================
// 前方宣言
//=============================================================================
class CGauge;

//=============================================================================
// プレイヤー2Dクラス
//=============================================================================
class CTimeLimit
{
public:

	CTimeLimit();			// コンストラクタ
	~CTimeLimit();												// デストラクタ

	static CTimeLimit*Create(float fTime);	// クリエイト

	HRESULT Init(void);				// 初期化処理
	void Uninit(void);				// 終了処理
	bool Update(void);				// 更新処理*返り値*制限時間いないか
	void Draw(void);				// 描画処理
	CGauge * GetGauge(void) { return m_pGauge; }
	CEvaluation::EVALUATION_TYPE CheckEvaluation(void); // 評価のチェック
private:
	float m_fTime;     // 時間
	float m_fMaxTime;  // 最大時間
	CGauge * m_pGauge; // ゲージクラス
};
#endif